Autodesk.Revit.DB.Electrical.DistributionSysType.HighLegPhase
The high-leg phase in the 3 phase 4 wires delta distribution system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The high-leg phase eHighLegPhase is not valid, only A, B, C is valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The distribution system is not a 3 phase 4 wires delta distribution system.
Since:
2025